wouyanglv/bmi160/nRF5_SDK_17.0.0_9d13099/examples/ble_central/implantable_MA_central/main.c
            if (m_memory_access_in_progress)
            {
                m_memory_access_in_progress = false;
                scan_start();
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register handlers for BLE and SoC events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
    NRF_SDH_SOC_OBSERVER(m_soc_observer, APP_SOC_OBSERVER_PRIO, soc_evt_handler, NULL);
}



/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/** @brief Clear bonding information from persistent storage
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for disabling the use of whitelist for scanning.
 */
static void whitelist_disable(void)
{
    if (!m_whitelist_disabled)
    {
        NRF_LOG_INFO("Whitelist temporarily disabled.");
        m_whitelist_disabled = true;
        nrf_ble_scan_stop();
        scan_start();
    }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            whitelist_disable();
            break;

        default:
            break;
    }
}


char *uint64_to_string (uint64_t input)
{
     static char result [21] = "";
     memset(&result [0], 0, sizeof(result));
     char temp [21] = "";
     char c;
     uint8_t base=10;

     while (input)
     {
        int num=input % base;
        input /= base;
        c= '0' + num;

        sprintf(temp, "%c%s", c, result);
        strcpy(result, temp);
     }
     return result;
}


void biosignal_decode (uint8_t *p_encoded_buffer)
{
    union timestamp_union last_timestamp;
    union accel_data_union accel_data;

    // Timestamp is uint64_t, sent by 8 * uint8_t
    for (int k =0; k<8; k++)
    {
        last_timestamp.timestamp_seg[k] = p_encoded_buffer[k];
     }
    
     uint8_t frame_num = p_encoded_buffer [8];
     int16_t accel_samples [frame_num*3]; // 3 samples per frame: x, y, z. each sample 2 bytes.
    
     char packet [2048] = "";
     memset(&packet [0], 0, sizeof(packet));
     sprintf(packet, "(*%s*%d",  uint64_to_string (last_timestamp.timestamp_uint64), frame_num);     
     
     for (int i = 0; i < frame_num*3; i++)
     {

        accel_data.accel_data_uint8[0] = p_encoded_buffer [i*2+9];
        accel_data.accel_data_uint8[1] = p_encoded_buffer [i*2+10];
        accel_samples [i] = accel_data.accel_data_uint16;

        char buffer [8];
        memset(&buffer [0], 0, sizeof(buffer));
        sprintf(buffer, "*%d", accel_samples [i]);          
        strcat(packet, buffer);
     }

     strcat(packet, "*)\n");

     int packet_len=strlen(packet);
     for (int kk=0; kk<packet_len; kk++)
     {
        app_uart_put(packet[kk]);
     }
     
    

}


/**@brief Bio Signal Collector Handler.
 */
static void biosig_svc_c_evt_handler(ble_biosig_svc_c_t * p_biosig_svc_c, ble_biosig_svc_c_evt_t * p_biosig_svc_c_evt)
{
    ret_code_t err_code;

    switch (p_biosig_svc_c_evt->evt_type)
    {
        case BLE_BIOSIG_SVC_C_EVT_DISCOVERY_COMPLETE:
        {
            NRF_LOG_DEBUG("Bio signal service discovered.");


            err_code = ble_biosig_svc_c_handles_assign(p_biosig_svc_c,
                                                p_biosig_svc_c_evt->conn_handle,
                                                &p_biosig_svc_c_evt->params.peer_db);
            APP_ERROR_CHECK(err_code);

            // Initiate bonding.
            err_code = pm_conn_secure(p_biosig_svc_c_evt->conn_handle, false);
            if (err_code != NRF_ERROR_BUSY)
            {
                APP_ERROR_CHECK(err_code);
            }

            // Bio Signal service discovered. Enable notification of Bio Signal Measurement.
            err_code = ble_biosig_svc_c_biosig_meas_notif_enable(p_biosig_svc_c);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_BIOSIG_SVC_C_EVT_BIOSIG_MEAS_NOTIFICATION:
        {          
           biosignal_decode(p_biosig_svc_c_evt->params.biosig_meas.hr_value);
            /*if (p_biosig_svc_c_evt->params.biosig_meas.rr_intervals_cnt != 0)
            {
                uint32_t rr_avg = 0;
                for (uint32_t i = 0; i < p_biosig_svc_c_evt->params.biosig_meas.rr_intervals_cnt; i++)
                {
                    rr_avg += p_biosig_svc_c_evt->params.biosig_meas.rr_intervals[i];
                }
                rr_avg = rr_avg / p_biosig_svc_c_evt->params.biosig_meas.rr_intervals_cnt;
                NRF_LOG_DEBUG("rr_interval (avg) = %d.", rr_avg);
            }*/
        } break;

        default:
            break;
    }
}


/**
 * @brief Bio Signal collector initialization.
 */
static void biosig_svc_c_init(void)
{
    ble_biosig_svc_c_init_t biosig_svc_c_init_obj;

    biosig_svc_c_init_obj.evt_handler   = biosig_svc_c_evt_handler;
    biosig_svc_c_init_obj.error_handler = service_error_handler;
    biosig_svc_c_init_obj.p_gatt_queue  = &m_ble_gatt_queue;

    ret_code_t err_code = ble_biosig_svc_c_init(&m_biosig_svc_c, &biosig_svc_c_init_obj);
    APP_ERROR_CHECK(err_code);
}


/**
 * @brief Database discovery collector initialization.
 */
static void db_discovery_init(void)
{
    ble_db_discovery_init_t db_init;

    memset(&db_init, 0, sizeof(db_init));

    db_init.evt_handler  = db_disc_handler;
    db_init.p_gatt_queue = &m_ble_gatt_queue;

    ret_code_t err_code = ble_db_discovery_init(&db_init);

    APP_ERROR_CHECK(err_code);
}

